#6. Шаховий кінь ходить буквою "Г" - на дві клітинки по вертикалі в будь-якому напрямку і на одну клітинку по горизонталі, чи навпаки. Дані дві різні клітини шахівниці, визначте, чи може кінь потрапити з першої клітини на другу одним ходом.
#якщо кінь ходить вниз або вгору буквою то його координата coordinate_x змінюється на 1 а coordinate_y на 2, якщо вліво і вправо то навпаки X на 2 а Y на 1.
x1 = int(input("Введіть координату на шахівниці X1: "))
y1 = int(input("Введіть координату на шахівниці X2: "))
x2 = int(input("Введіть координату на шахівниці Y1: "))
y2 = int(input("Введіть координату на шахівниці Y2: "))
dx = abs(x1 - x2)
dy = abs(y1 - y2)
if dx == 1 and dy == 2 or dx == 2 and dy == 1:
    print('YES')
else:
    print('NO')

